__Goal this week : Recommandation System__

In [1]:
'''
입출력 : 텍스트 파일 , DB , network
테이블 -> 데이터프레임 (ex: read_csv , read_excel , read_table(\t 구분자) , read_html , read_json , read_pickle)
'''

'\n입출력 : 텍스트 파일 , DB , network\n테이블 -> 데이터프레임 (ex: read_csv , read_excel , read_table(\t 구분자) , read_html , read_json , read_pickle)\n'

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('C:/data/examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
df = pd.read_table('C:/data/examples/ex1.csv',sep=',')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
df2 = pd.read_csv('C:/data/examples/ex2.csv',header=None,names=list('abcde'),index_col='e')  # indexl_col=4 도 가능 숫자로.
df2

       a   b   c   d
e
hello  1   2   3   4
world  5   6   7   8
foo    9  10  11  12

In [13]:
mindex_df = pd.read_csv('C:/data/examples/csv_mindex.csv',index_col=['key1','key2']) # 계층적 인덱스 -> 대분류 , 중분류 같은 느낌
#mindex_df = pd.read_csv('C:/data/examples/csv_mindex.csv',index_col=[0,1]) # 가능
mindex_df

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [14]:
f = list(open('c:/data/examples/ex3.txt'))
f

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [16]:
df3 = pd.read_table('C:/data/examples/ex3.txt',sep='\s+') # \s 정규표현식에서 공백표현
df3

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [21]:
df4 = pd.read_csv('c:/data/examples/ex4.csv',skiprows=[0,2,3]) # drop 과 혼동 X
df4
#np4 = np.loadtxt('c:/data/examples/ex4.csv',delimiter=',',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [24]:
df5 = pd.read_csv('c:/data/examples/ex5.csv')
df5.isnull()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

### __na_values 사용 : na_values={'누락','없음','조사안됨',...,etc}__

In [26]:
df5 = pd.read_csv('c:/data/examples/ex5.csv',na_values={'NULL'})  # {} 안에 값들은 모두 NaN 으로 처리.
df5

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [28]:
pd.read_csv('c:/data/examples/ex5.csv',na_values={'NULL','two','foo'}) # 전체에 대해서
pd.read_csv('c:/data/examples/ex5.csv',na_values={'message':'foo','something':'two'})  # 특정 컬럼에 대해서 특별 지정

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

__데이터를 나누어 읽기 : 데이터를 읽어들일 때 용량이 커 부담 될 때, 부분 부분 읽는 과정__

In [29]:
df6 = pd.read_csv('c:/data/examples/ex6.csv',nrows=5) # 5줄만 읽겠다
df6

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [46]:
# 파일을 아예 나누어 읽기 작업할때
chunker = pd.read_csv('c:/data/examples/ex6.csv',chunksize=1000) # 1000개씩 끊어서 읽겠다.
chunker # iter-able 한 객체가 만들어짐

In [47]:
tot = pd.Series([])
for piece in chunker:
    tot=tot.add(piece['key'].value_counts(),fill_value=0)
tot

<ipython-input-47-d2672b8df0fd>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

0    151.0
1    146.0
2    152.0
3    162.0
4    171.0
5    157.0
6    166.0
7    164.0
8    162.0
9    150.0
A    320.0
B    302.0
C    286.0
D    320.0
E    368.0
F    335.0
G    308.0
H    330.0
I    327.0
J    337.0
K    334.0
L    346.0
M    338.0
N    306.0
O    343.0
P    324.0
Q    340.0
R    318.0
S    308.0
T    304.0
U    326.0
V    328.0
W    305.0
X    364.0
Y    314.0
Z    288.0
dtype: float64

In [51]:
tot.sort_values(ascending=False)  # 값 기준으로 내림차순 정렬

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
V    328.0
I    327.0
U    326.0
P    324.0
D    320.0
A    320.0
R    318.0
Y    314.0
G    308.0
S    308.0
N    306.0
W    305.0
T    304.0
B    302.0
Z    288.0
C    286.0
4    171.0
6    166.0
7    164.0
8    162.0
3    162.0
5    157.0
2    152.0
0    151.0
9    150.0
1    146.0
dtype: float64

In [52]:
data = pd.read_csv('c:/data/examples/ex5.csv')
data.to_csv('c:/data/examples/ex5_save_test.csv')

In [54]:
data.to_csv("c:/data/examples/ex5_save_test2.csv",sep='|')

In [59]:
data.to_csv('c:/data/examples/ex5_save_test3.csv',na_rep='누락',encoding='utf-8')

In [58]:
data.to_csv('c:/data/examples/ex5_save_test4.csv',index=False)

In [60]:
data.to_csv('c:/data/examples/ex5_save_test5.csv',index=False,header=False) # 인덱스도, 칼럼명도 다 버리고 값들만 저장

In [61]:
data.to_csv('c:/data/examples/ex5_save_test6.csv',index=False,header=False,columns=['a','b','c']) # 특정 컬럼들만 저장

__날짜 데이터 포멧팅__

In [64]:
dates = pd.date_range('8/1/2020',periods=7) # RNN : 시계열 데이터 분석 모델

ts= pd.Series(np.arange(7),index=dates)
ts.to_csv('tseries.csv',header=False)

__Json 파일 읽기/쓰기__

In [ ]:
from numpy.random import randn
np.random.seed(123)
import os
import matplot.pyplot as plt